// src/routes/resources/[id]/+page.js

export const load = async ({ params }) => {
  const { id } = params;

  // симулираме "база данни" с ръчно описани ресурси
  const resources = [
    {
      id: "8mi-mart",
      title: "Работни листове за 8-ми март",
      description:
        "Работни листове с упражнения и игри, посветени на празника 8-ми март - ден на мама. Подходящи за деца в предучилищна възраст.",
      filename: "Работни листове Подарък за 8 март, ОЦ Логос-Аз и Ти.pdf",
      tags: ["работни листове", "8-ми март", "майка", "деца", "празник"],
    },
    {
      id: "velikden",
      title: "Работни листове „Шарен Великден“",
      description:
        "Потопете децата в празничното настроение с настъпващия Великден. Нашите тематични и авторски материали са създадени с грижа към децата да усвояват знания чрез игра. В тях ще откриете: игри за пространствена ориентация и задачи за следване на образец; сортиране на великденски предмети по цвят, вид и форма; упражнения за изпълнение на словесни инструкции и обогатяване на речниковия запас от думи; дейности за развитие на фината моторика; задачи, стимулиращи въображението и мисленето; Подходящо за: 👧 деца в предучилищна възраст; 🗣 логопедични занимания; 🏡 занимания у дома. Ако материалите Ви допадат, ще се радваме да ги споделите с приятели. Приятни и шарени занимания! 🐰",
      filename: "Работни листове Шарен Великден, ОЦ Логос-Аз и Ти.pdf",
      tags: ["великден", "празник", "родители", "упражнения","деца"],
    },
    // {
    //   id: "primer",
    //   title: "Първи стъпки: Практически наръчник",
    //   description:
    //     "Кратко ръководство как да започнете с упражненията у дома. Подходящо за родители и специалисти.",
    //   filename: "пъзел.pdf",
    //   tags: ["родители", "упражнения"],
    // },
    // {
    //   id: "poster",
    //   title: "Плакат: Азбуката",
    //   description:
    //     "Красив плакат с българската азбука, подходящ за разпечатване в класната стая или у дома.",
    //   filename: "Screenshot_2.png",
    //   tags: ["визуален материал", "азбука"],
    // },
  ];

  // намираме съответния ресурс по id
  const item = resources.find((r) => r.id === id);

  if (!item) {
    return { status: 404, error: new Error("Ресурсът не е намерен") };
  }

  // взимаме път към файла
  const files = import.meta.glob("/src/lib/resources/*", {
    eager: true,
    as: "url",
  });
  const entry = Object.entries(files).find(([path]) =>
    path.endsWith(item.filename),
  );
  const href = entry ? entry[1] : "";

  return {
    item: {
      ...item,
      href,
      ext: item.filename.split(".").pop(),
    },
  };
};
