export const posts = [
  {
    id: "purva-statia",
    title: "Как да помогнем на дете с говорни трудности у дома",
    excerpt:
      "Практични стъпки и игри за подкрепа на речта и увереността – кратко и приложимо.",
    date: "2026-03-05",
    keywords: ["логопед", "деца", "реч", "упражнения у дома"],
    cover: "cover-1.jpg",
    content: [
      "Най-важното е упражненията да изглеждат като игра, а не като „урок“.",
      "Правете кратки сесии (5–10 мин) всеки ден, вместо дълги веднъж седмично.",
      "Хвалете усилието, не само резултата. Това повишава мотивацията и увереността.",
    ],
    images: ["1.jpg", "2.jpg"],
  },
  {
    id: "purva-statia",
    title: "Бла бла помогнем на дете с говорни трудности у дома",
    excerpt:
      "Практични стъпки и игри за подкрепа на речта и увереността – кратко и приложимо.",
    date: "2026-03-05",
    keywords: ["логопед", "деца", "реч", "упражнения у дома"],
    cover: "cover-1.jpg",
    content: [
      "Най-важното е упражненията да изглеждат като игра, а не като „урок“.",
      "Правете кратки сесии (5–10 мин) всеки ден, вместо дълги веднъж седмично.",
      "Хвалете усилието, не само резултата. Това повишава мотивацията и увереността.",
    ],
    images: ["1.jpg", "2.jpg"],
  },
  {
    id: "purva-statia",
    title: "Как да помогнем на дете с говорни трудности у дома",
    excerpt:
      "Практични стъпки и игри за подкрепа на речта и увереността – кратко и приложимо.",
    date: "2026-03-05",
    keywords: ["логопед", "деца", "реч", "упражнения у дома"],
    cover: "cover-1.jpg",
    content: [
      "Най-важното е упражненията да изглеждат като игра, а не като „урок“.",
      "Правете кратки сесии (5–10 мин) всеки ден, вместо дълги веднъж седмично.",
      "Хвалете усилието, не само резултата. Това повишава мотивацията и увереността.",
    ],
    images: ["1.jpg", "2.jpg"],
  },
  {
    id: "purva-statia",
    title: "Как да помогнем на дете с говорни трудности у дома",
    excerpt:
      "Практични стъпки и игри за подкрепа на речта и увереността – кратко и приложимо.",
    date: "2026-03-05",
    keywords: ["логопед", "деца", "реч", "упражнения у дома"],
    cover: "cover-1.jpg",
    content: [
      "Най-важното е упражненията да изглеждат като игра, а не като „урок“.",
      "Правете кратки сесии (5–10 мин) всеки ден, вместо дълги веднъж седмично.",
      "Хвалете усилието, не само резултата. Това повишава мотивацията и увереността.",
    ],
    images: ["1.jpg", "2.jpg"],
  },

  // добавяй още постове тук
];

export const getPostById = (id) => posts.find((p) => p.id === id);

export const estimateReadingMinutes = (post) => {
  const text = [post.title, post.excerpt, ...(post.content || [])].join(" ");
  const words = text.trim().split(/\s+/).filter(Boolean).length;
  const wpm = 180; // нормално темпо
  return Math.max(1, Math.round(words / wpm));
};
